## Content : 
### 01.Importing libraries
### 02. Importing Dataframes
### 03. Merge Data
### 04. Reducing Memory
### 05. Exporting Data in Pickle Format

# 01.Importing libraries

In [5]:
# Import libraries

import pandas as pd
import numpy as np
import os

# 02. Importing Dataframes

In [7]:
path= r'C:\Users\Bilel\Desktop\data_analyst_Carrer Foundry\Data Immersion\07-12-24 Instacart Basket Analysis'
df_ords_prior = pd.read_csv(os.path.join(path,'02 Data', 'Original Data', 'orders_products_prior.csv'),index_col = False)
df_ords  = pd.read_csv(os.path.join(path,'02 Data', 'Prepared Data', 'orders_checked.csv'),index_col = False)

In [8]:
#chek the output
df_ords.head ()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False

In [9]:
df_ords = df_ords.drop (columns = ['Unnamed: 0'])
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [10]:
df_ords.shape

(3421083, 7)

In [11]:
df_ords_prior.shape

(32434489, 4)

In [12]:
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

# 03. Merge Data

In [14]:
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [15]:
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [16]:
df_merged_large.shape

(32434489, 11)

In [17]:
df_merged_large['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

# 04. Reducing Memory

In [18]:
df_merged_large['order_number'].max()

99

In [35]:
df_merged_large['order_number'].min()

1

In [40]:
# reducing the memory by changing data types
df_merged_large['order_id'] = df_merged_large['order_id'].astype ('int32')
df_merged_large['user_id'] = df_merged_large['user_id'].astype ('int32')
df_merged_large['order_number'] = df_merged_large['order_number'].astype ('int8')
df_merged_large['orders_day_of_week'] = df_merged_large['orders_day_of_week'].astype ('int8')
df_merged_large['order_hour_of_day'] = df_merged_large['order_hour_of_day'].astype ('int8')
df_merged_large['days_since_prior_order'] = df_merged_large['days_since_prior_order'].astype ('float32')
df_merged_large['product_id'] = df_merged_large['product_id'].astype ('int32')
df_merged_large['add_to_cart_order'] = df_merged_large['add_to_cart_order'].astype ('int32')
df_merged_large['reordered'] = df_merged_large['reordered'].astype ('int8')

# 05. Exporting Data in Pickle Format

In [42]:
df_merged_large.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_combined.pkl'))